#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Oct 24 14:17:02 2022

@author: yuyi
"""
import pandas as pd
import numpy as np

# read the combined file into dataframe
df = pd.read_csv('ifoodie.csv')

# to display all columns
pd.set_option('display.max_columns', None)

# delete the duplicated rows, some restaurants appear in multiple category pages
df.drop_duplicates(subset=['title', 'address'], inplace = True)

# remove the list braket  '[]'
df['review_row'] = df['review_row_nums'].apply(lambda x: x[1:-1])

# seperate review_row_nums into 3 columns
df[['rating', 'review_count', 'avg_price1','avg_price2']] = \
    df['review_row'].str.split(',', expand=True)

# strip '' in all the columns and replace empty string with NaN
df = df.replace("'", "", regex=True)
df = df.replace(r'^\s*$', np.nan, regex=True)
df = df.fillna(method='ffill')
df = df.fillna(value=np.nan)

# convert data type of the columns: from object to int
df['rating'] = df['rating'].astype(str).astype(float)
df['review_count'] = df['review_count'].astype(str).astype(int, errors='ignore')
df['avg_price1'] = df['avg_price1'].astype(str).astype(int, errors='ignore')

# remove the unecessary columns
df = df.drop(['review_row_nums', 'review_row', 'avg_price2'] , axis=1)

# change column name
df.rename(columns={'avg_price1':'avg_price'}, inplace=True)

# clean the imcompleted addresses manually 
df = df.replace(['台北市敦化南路一段246號', '台北市敦化南路二段39-1號', '台北市敦化南路一段177巷47號',
'台北市敦化南路一段331號2樓', '台北市敦化南路二段201號6樓', '台北市敦化南路一段161巷60號'],
                ['台北市大安區敦化南路一段246號', '台北市大安區敦化南路二段39-1號', '台北市大安區敦化南路一段177巷47號',
                '台北市大安區敦化南路一段331號2樓', '台北市大安區敦化南路二段201號6樓', '台北市大安區敦化南路一段161巷60號'])
df = df.replace(['台北市中山北路五段505巷29號', '台北市中山北路6段35巷2號1樓', '士林區中山北路七段154巷7號'],
                ['台北市士林區中山北路五段505巷29號', '台北市士林區中山北路6段35巷2號1樓', '台北市士林區中山北路七段154巷7號'])
df = df.replace(['台北市中山北路二段39巷3號B1', '台北市中山北路二段77巷8-7號', '台北市中山北路一段105巷20號',
                 '台北市中山北路二段36巷21號', '臺北市中山北路二段137巷18之1號', '台北市中山北路一段140巷14號'],
                ['台北市中山區中山北路二段39巷3號B1', '台北市中山區中山北路二段77巷8-7號', '台北市中山區中山北路一段105巷20號',
                                 '台北市中山區中山北路二段36巷21號', '台北市中山區中山北路二段137巷18之1號', '台北市中山區中山北路一段140巷14號'])
df = df.replace(['台北市復興北路430巷6號', '台北市復興北路303號1樓'], ['台北市中山區復興北路430巷6號', '台北市松山區復興北路303號1樓'])
df = df.replace(['台北市信義路3段147巷5弄4號1樓','台北市信義路五段16號1樓','台北市信義路四段265巷15號'], 
                ['台北市大安區信義路3段147巷5弄4號1樓', '台北市信義區信義路五段16號1樓', 
                 '台北市信義區信義路四段265巷15號'])
df = df.replace(['北投區裕民四路7號'], ['台北市北投區裕民四路7號'])
df = df.replace(['台北市成都路27巷12號'], ['台北市萬華區成都路27巷12號'])
df = df.replace(['基隆路二段285號'], ['台北市大安區基隆路二段285號'])
df = df.replace(['臺北市臺北市忠孝東路三段300號'], ['臺北市大安區忠孝東路三段300號'])
df = df.replace(['台北市八德路一段82巷9弄14號', '台北市八德路一段1號' ,'台北市八德路二段346巷3弄2號','台北市八德路一段1號', '台北市八德路二段366巷18號' ],
                ['台北市中正區八德路一段82巷9弄14號', '台北市中正區八德路一段1號' ,'台北市松山區八德路二段346巷3弄2號', '台北市中正區八德路一段1號', '台北市松山區八德路二段366巷18號'])
df = df.replace(['No. 20松江路108巷中山區臺北市臺灣 104 NoF'], ['台北市中山區松江路108巷20號'])
df = df.replace(['台北市區松壽路九號六樓'], ['台北市信義區松壽路九號六樓'])
df = df.replace(['臺北市松江路128號', '臺北市松江路128號', '台北市松江路362巷57號1F'],
                ['臺北市中山區松江路128號', '臺北市中山區松江路128號', '台北市中山區松江路362巷57號1F'])
df = df.replace(['台北市和平東路二段76巷23弄9號', '台北市和平東路三段228巷9號'], ['台北市大安區和平東路二段76巷23弄9號', '台北市大安區和平東路三段228巷9號'])
df = df.replace(['台北市光復南路280巷29號', '台北市光復南路54號','台北市光復南路346巷50號','台北市光復南路420巷21號'], 
                ['台北市大安區光復南路280巷29號', '台北市大安區光復南路54號','台北市大安區光復南路346巷50號',
                 '台北市大安區光復南路420巷21號'])
df = df.replace(['台北市忠孝東路四段553巷22弄51-1號', '台北市忠孝東路五段68號4樓', 
                 '大安區忠孝東路四段101巷29號1樓', '台北市忠孝東路553巷52弄23號1樓',
                 '台北市忠孝東路四段170巷5弄22號', '台北市忠孝東路五段之17號之3B1',
                 '台北市忠孝東路四段223巷36號', '台北市忠孝東路四段223巷52號', 
                 '台北市忠孝東路二段134巷20號', '台北市忠孝東路七段369號',
                 '台北市忠孝東路五段412之6號', '台北市忠孝東路三段248巷10號'], 
                ['台北市信義區忠孝東路四段553巷22弄51-1號', '台北市信義區忠孝東路五段68號4樓', 
                                 '台北市大安區忠孝東路四段101巷29號1樓', '台北市信義區忠孝東路四段553巷52弄23號1樓',
                                 '台北市忠孝東路大安區四段170巷5弄22號', '台北市信義區忠孝東路五段之17號之3B1',
                                 '台北市大安區忠孝東路四段223巷36號', '台北市大安區忠孝東路四段223巷52號', 
                                 '台北市中正區忠孝東路二段134巷20號', '台北市南港區忠孝東路七段369號',
                                 '台北市信義區忠孝東路五段412之6號', '台北市大安區忠孝東路三段248巷10號'])
df = df.replace(['台北市南京東路三段303巷7弄7號', '台北市南京東路二段49號2樓', 
'台北市南京東路五段250巷18弄9號','松山區南京東路三段256巷19號','台北市南京東路一段34號2樓'], 
                ['台北市松山區南京東路三段303巷7弄7號', '台北市中山區南京東路二段49號2樓', 
                '台北市松山區南京東路五段250巷18弄9號','台北市松山區南京東路三段256巷19號',
                '台北市中山區南京東路一段34號2樓'])
df = df.replace(['台北市樂群三路299號6樓'], ['台北市中山區樂群三路299號6樓'])
df = df.replace(['大安區羅斯福路三段283巷14弄30號', '台北市羅斯福路四段92號1樓25號攤位', 
                 '台北市羅斯福路四段52巷16弄13號', '台北市羅斯福路四段92號1樓5356攤位水源市場內'], 
                ['台北市大安區羅斯福路三段283巷14弄30號', '台北市中正區羅斯福路四段92號1樓',
                 '台北市中正區羅斯福路四段52巷16弄13號', '台北市中正區羅斯福路四段92號1樓'])
df = df.replace(['臺北市松山鎮敦化北路158號', '臺北市松山鎮敦化北路145巷5號'], 
                ['台北市松山區敦化北路158號', '台北市松山區敦化北路145巷5號'])
df = df.replace(['台北市遼寧街95號'], ['台北市中山區遼寧街95號'])
df = df.replace(['臺北市民權東路三段60巷6號', '台北市民權東路六段184-1號', '臺北市民權東路三段56號Zhongshan'], 
                ['台北市中山區北市民權東路三段60巷6號', '台北市內湖區民權東路六段184-1號', '台北市中山區民權東路三段56號'])
df = df.replace(['台北大安區安和路一段21巷9號'], ['台北市大安區安和路一段21巷9號'])
df = df.replace(['台湾台北市中山區新生北路三段18號', '臺北市中山區長春路137巷7號'], 
                ['台北市中山區新生北路三段18號', '台北市中山區長春路137巷7號'])
df = df.replace(['台北市林森北路133巷3號', '台北市林森北路119巷81號1樓', '台北市林森北路133巷23號'], 
                ['台北市中山區林森北路133巷3號', '台北市中山區林森北路119巷81號1樓', '台北市中山區林森北路133巷23號'])
df = df.replace(['台北市三民路113巷17號02'], ['台北市松山區三民路113巷17號'])
df = df.replace(['忠孝東路四段216巷32弄8號'], ['台北市大安區忠孝東路四段216巷32弄8號'])
df = df.replace(['台北市敦化北路244巷51號'], ['台北市松山區敦化北路244巷51號'])
df = df.replace(['台北市復興南路二段148巷37號', '台北市復興南路一段74號',
                 '台北市復興南路一段135巷5號', '台北市復興南路一段39號'], 
                ['台北市大安區復興南路二段148巷37號', '台北市大安區復興南路一段74號',
                                 '台北市大安區復興南路一段135巷5號', '台北市大安區復興南路一段39號'])
df = df.replace(['內湖區瑞光路15號'], ['台北市內湖區瑞光路15號'])
df = df.replace(['台北市松壽路12號1', '台北市松壽路11號2F'], 
                ['台北市信義區松壽路12號', '台北市信義區松壽路11號'])
df = df.replace(['北投區光明路129號'], ['台北市北投區光明路129號'])
df = df.replace(['台北市北平西路3號', '台北市北平西路3號2樓'], 
                ['台北市中正區北平西路3號', '台北市中正區北平西路3號2樓'])
df = df.replace(['台北市安和路二段69巷3號', '台北市安和路二段133號'], 
                ['台北市大安區安和路二段69巷3號', '台北市大安區安和路二段133號'])
df = df.replace(['大同區重慶北路3段113巷46號', '台北市重慶北路一段83巷8號1樓'], 
                ['台北市大同區重慶北路3段113巷46號', '台北市大同區重慶北路一段83巷8號1樓'])
df = df.replace(['台北市赤峰街47巷16號2樓'], ['台北市大同區赤峰街47巷16號2樓'])
df = df.replace(['和平東路三段228巷23號1樓'], ['台北市大安區和平東路三段228巷23號1樓'])
df = df.replace(['台北市台北市中正區南陽街1號2樓'], ['台北市中正區南陽街1號2樓'])
df = df.replace(['台北市北安路518巷3號'], ['台北市中山區北安路518巷3號'])
df = df.replace(['台北市內湖路一段283號2樓', '台北市內湖路一段737巷3之1號',
                 '台北市內湖路一段285巷8弄1號', '台北市內湖路一段239號'], 
                ['台北市內湖區內湖路一段283號2樓', '台北市內湖區內湖路一段737巷3之1號',
                                 '台北市內湖區內湖路一段285巷8弄1號', '台北市內湖區內湖路一段239號'])
df = df.replace(['大同區民樂街55號'], ['台北市大同區民樂街55號'])
df = df.replace(['台北市重慶南路二段51號'], ['台北市中正區重慶南路二段51號'])
df = df.replace(['台北市長安東路2段171號'], ['台北市中山區長安東路2段171號'])
df = df.replace(['台北市南陽街20號','中正區南陽街13-2號'], ['台北市中正區南陽街20號','台北市中正區南陽街13-2號'])
df = df.replace(['台北市漢口街二段54號之4'], ['台北市萬華區漢口街二段54號之4'])
df = df.replace(['台北市雙城街28巷8號', '松山區光復北路85巷15號1樓',
                 '台灣台北市信義區忠孝東路四段553巷22弄5號'], 
                ['台北市中山區雙城街28巷8號', '台北市松山區光復北路85巷15號1樓', 
                 '台北市信義區忠孝東路四段553巷22弄5號'])
df = df.replace(['台北市至善路二段449號1樓'], ['台北市士林區至善路二段449號1樓'])
df = df.replace(['大同區迪化街一段328號', '嗎嗎臺北市中山區長春路137巷7號'], 
                ['台北市大同區迪化街一段328號', '台北市中山區長春路137巷7號'])
df = df.replace(['之2號臺北市文山區景華街165之1'], ['台北市文山區景華街165之1號'])
df = df.replace(['台北市仁愛路4段409號', '台北市仁愛路四段300巷26弄19號'], 
                ['台北市大安區仁愛路4段409號', '台北市大安區仁愛路四段300巷26弄19號'])
df = df.replace(['台北市忠孝東路大安區四段170巷5弄22號'], ['台北市大安區忠孝東路四段170巷5弄22號'])
df = df.replace(['台北市市民大道七段8號', '台北市市民大道四段21號'], 
                ['台北市南港區市民大道七段8號', '台北市松山區市民大道四段21號'])
df = df.replace(['台北市新生北路二段76巷37號'], ['台北市中山區新生北路二段76巷37號'])
df = df.replace(['台北市文山品興隆路三段31號'], ['台北市文山區品興隆路三段31號'])
df = df.replace(['長安東路一段12號2樓', '中山北路一段121巷13', '中山北路一段33巷26號'], 
                ['台北市中山區長安東路一段12號2樓', '台北市中山區中山北路一段121巷13', '台北市中山北路一段33巷26號'])
df = df.replace(['台北市研究院路一段88號'], ['台北市南港區研究院路一段88號'])
df = df.replace(['文山區興隆路三段304巷11號'], ['台北區文山區興隆路三段304巷11號'])
df = df.replace(['台北市永康街7巷3號'], ['台北市大安區永康街7巷3號'])
df = df.replace(['中山北路一段121巷13-2號'], ['台北市中山區中山北路一段121巷13-2號'])
df = df.replace(['信義區松高路12號B1'], ['台北市信義區松高路12號'])
df = df.replace(['台北市敬業三路20號5F'], ['台北市中山區敬業三路20號'])
df = df.replace(['台北市杭州南路二段19號'], ['台北市大安區杭州南路二段19號'])
df = df.replace(['台北市愛國東路105號'], ['台北市大安區愛國東路105號'])
df = df.replace(['民生東路二段147巷11弄2號'], ['台北市中山區民生東路二段147巷11弄2號'])
df = df.replace(['台北市大同街206之4號1樓'], ['台北市北投區大同街206之4號1樓'])
df = df.replace(['樓臺北市萬華區成都路54之2號1'], ['台北市萬華區成都路54之2號1樓'])
df = df.replace(['中正區中華路二段315巷5弄9號攤位'], ['台北市中正區中華路二段315巷5弄'])
df = df.replace(['台北市瑞安街75號'], ['台北市大安區瑞安街75號'])
df = df.replace(['臺北市昆明街25號'], ['台北市萬華區昆明街25號'])
df = df.replace(['南港區經貿二路168-188號C棟3F', '南港區經貿二路66之2號一樓'], 
                ['台北市南港區經貿二路168號', '台北市南港區經貿二路66之2號一樓'])
df = df.replace(['台北市廣州街8巷7號'], ['台北市中正區廣州街8巷7號'])
df = df.replace(['臺北市泰順街16巷41號'], ['台北市大安區泰順街16巷41號'])
df = df.replace(['台北市忠孝西路一段50號3樓'], ['台北市中正區忠孝西路一段50號3樓'])
df = df.replace(['台北市民生東路三段158號', '台北市民生東路三段130巷18弄9號'], 
                ['台北市松山區民生東路三段158號', '台北市松山區民生東路三段130巷18弄9號'])
df = df.replace(['台北市天母東路43巷3號', '台北市天母東路68號7樓'], 
                ['台北市士林區天母東路43巷3號', '台北市士林區天母東路68號7樓'])
df = df.replace(['台北市中山北路一段33巷26號'], ['台北市中山區中山北路一段33巷26號'])
df = df.replace(['臨江街87-11號'], ['台北市大安區臨江街87-11號'])
df = df.replace(['台北市汀州路3段169號'], ['台北市中正區汀州路3段169號'])
df = df.replace(['萬華區西寧南路36-45號'], ['台北市萬華區西寧南路36-45號'])
df = df.replace(['號臺北市大安區敦化南路二段269'], ['台北市大安區敦化南路二段269號'])
df = df.replace(['松山區南京東路三段256巷19號1F'], ['台北市松山區南京東路三段256巷19號'])
df = df.replace(['八德路中崙市場美食街二樓49號位'], ['台北市松山區八德路三段76號'])
df = df.replace(['臺北市新東街11巷14號'], ['台北市松山區新東街11巷14號'])
df = df.replace(['臺灣106TaipeiCityDa’anDistrict通安街49號'], ['台北市大安區通安街49號'])
df = df.replace(['台北市師大路114巷5號'], ['台北市大安區師大路114巷5號'])
df = df.replace(['臺北大同區承德路一段1號4樓'], ['台北市大同區承德路一段1號4樓'])
df = df.replace(['台北市莊敬路208號'], ['台北市信義區莊敬路208號'])
df = df.replace(['台北市士民大道三段159號'], ['台北市中山區市民大道三段159號'])
df = df.replace(['台北市吉祥路17號'], ['台北市松山區吉祥路17號'])
df = df.replace(['大安區辛亥路二段165號1樓'], ['台北市大安區辛亥路二段165號1樓'])


# extract district from address
df['district'] = df['address'].str[3:6]

# keep only the rows in districts of taipei city
df = df.loc[df['district'].isin(['南港區', '大安區', '士林區', '信義區', '松山區', 
                            '中山區', '萬華區', '內湖區', '中正區', '大同區',
                            '文山區', '北投區'])]

# rearrange column orders
df = df[['title', 'address', 'district', 'rating', 
         'review_count', 'avg_price', 'categories']]

# remove rows which exceed the max value of rating
df = df[df['rating']<6]




# save cleaned dataframe to new csv file
df.to_csv('ifoodie_cleaned.csv', index=False)

# save for converting address to coordinates later 
address_df = df[['title', 'address']]
address_df.to_csv('ifoodie_address.csv', index=False)











